In [16]:
# Pannel Data
import pandas as pd
import numpy as np

In [17]:
# Series
labels = ["A", "B", "C", "D"]
list_2 = [1,2,3,4]
arr = np.array(list_2)
arr
dict_1 = {
    'a' :1,
    'b' : 2,
    'c' : 3,
    'd' : 4
}

In [11]:
type(pd.Series(list_2, index=labels)) #Series = class

pandas.core.series.Series

In [10]:
pd.Series(list_2, index=labels) #64 bit integer (dtype - data type)

A    1
B    2
C    3
D    4
dtype: int64

In [12]:
pd.Series(data=labels, index=list_2)

1    A
2    B
3    C
4    D
dtype: object

In [18]:
pd.Series(dict_1)

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
pd.Series(data=arr, index=labels)

A    1
B    2
C    3
D    4
dtype: int64

In [21]:
pd.Series(data=arr, index=["Finland","Sweden","Germany","France"])

Finland    1
Sweden     2
Germany    3
France     4
dtype: int64

In [37]:
# DATAFRAME

arr2 = np.random.randn(4,5) #normal distribution

In [38]:
index = ["A","B","C","D"]
columns = ["X", "Y", "Z", "T", "U"]

In [48]:
df = pd.DataFrame(data=arr2, index=index, columns = columns) #1st parameter is the data i want to input

In [40]:
df

          X         Y         Z         T         U
A  1.199397 -0.840896 -0.637699  1.319196 -1.362873
B -1.935377 -1.237842  0.186820 -1.180107 -1.028740
C -0.382908  0.000678  1.297061  0.412396  0.531808
D -0.517801 -1.707171 -0.690638  0.883493  0.532755

In [67]:
type["X"]

A    0.166225
B   -0.279196
C    1.308007
D    0.382621
Name: X, dtype: float64

In [51]:
df[['X','Y']] #display multiple columns adding two square brackets

          X         Y
A  1.199397 -0.840896
B -1.935377 -1.237842
C -0.382908  0.000678
D -0.517801 -1.707171

In [68]:
df['O'] = [1,2,3,4] #adding data into a new column
df

          X         Y         Z         T         U  O
A  1.199397 -0.840896 -0.637699  1.319196 -1.362873  1
B -1.935377 -1.237842  0.186820 -1.180107 -1.028740  2
C -0.382908  0.000678  1.297061  0.412396  0.531808  3
D -0.517801 -1.707171 -0.690638  0.883493  0.532755  4

In [69]:
df.drop('O', axis=1, inplace=True) #axis is a horizontal axis(row), axis = 1 is vertical axis (column)

In [70]:
df.drop('A')

          X         Y         Z         T         U
B -1.935377 -1.237842  0.186820 -1.180107 -1.028740
C -0.382908  0.000678  1.297061  0.412396  0.531808
D -0.517801 -1.707171 -0.690638  0.883493  0.532755

In [71]:
# Row selecting
df

          X         Y         Z         T         U
A  1.199397 -0.840896 -0.637699  1.319196 -1.362873
B -1.935377 -1.237842  0.186820 -1.180107 -1.028740
C -0.382908  0.000678  1.297061  0.412396  0.531808
D -0.517801 -1.707171 -0.690638  0.883493  0.532755

In [72]:
df.loc['A'] #printing the row of A

X    1.199397
Y   -0.840896
Z   -0.637699
T    1.319196
U   -1.362873
Name: A, dtype: float64

In [73]:
df.iloc[2] #index location

X   -0.382908
Y    0.000678
Z    1.297061
T    0.412396
U    0.531808
Name: C, dtype: float64

In [74]:
# Subset
df.iloc[:3,:3]

          X         Y         Z
A  1.199397 -0.840896 -0.637699
B -1.935377 -1.237842  0.186820
C -0.382908  0.000678  1.297061

In [75]:
df.loc[['A','B','C'],['X','T']]

          X         T
A  1.199397  1.319196
B -1.935377 -1.180107
C -0.382908  0.412396

In [ ]:
# Conditional selection

In [77]:
df[df > 0]

          X         Y         Z         T         U
A  1.199397       NaN       NaN  1.319196       NaN
B       NaN       NaN  0.186820       NaN       NaN
C       NaN  0.000678  1.297061  0.412396  0.531808
D       NaN       NaN       NaN  0.883493  0.532755

In [80]:
df[df['X'] > 0]

          X         Y         Z         T         U
A  1.199397 -0.840896 -0.637699  1.319196 -1.362873

In [81]:
df[(df['X'] > 0)]

          X         Y         Z         T         U
A  1.199397 -0.840896 -0.637699  1.319196 -1.362873

In [82]:
# Missing data
dictionary = {
    'a':[1,2, np.nan],
    'b':[6,np.nan, 8],
    'c':[np.nan, np.nan, 20]
}